# OriginalCategoryId Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
Part..::..OriginalCategoryId Property
Part Class See Also
---
The category Id of the original element corresponding to this Part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public ElementId OriginalCategoryId { get; set; }
```

Visual Basic
---
```text
Public Property OriginalCategoryId As ElementId
	Get
	Set
```

Visual C++
---
```text
public:
property ElementId^ OriginalCategoryId {
	ElementId^ get ();
	void set (ElementId^ value);
}
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..ArgumentException | When setting this property: dPartOriginalCategoryId is not an available member of the original category ids of the elements which formed this Part. |
| Autodesk.Revit.Exceptions..::..ArgumentNullException | When setting this property: A non-optional argument was null |

# See Also
Part Class
Autodesk.Revit.DB Namespace